{
  "token2id": {
    "<pad>": 0,
    "<sos>": 1,
    "<eos>": 2,
    "<unk>": 3,
    "a": 4,
    "you": 5,
    "i": 6,
    "good": 7,
    "is": 8,
    "what": 9,
    "i'm": 10,
    "are": 11,
    "do": 12,
    "the": 13,
    "like": 14,
    "me": 15,
    "you?": 16,
    "bye": 17,
    "can": 18,
    "how": 19,
    "to": 20,
    "your": 21,
    "am": 22,
    "happy": 23,
    "have": 24,
    "hello": 25,
    "hello!": 26,
    "help": 27,
    "hi": 28,
    "in": 29,
    "it": 30,
    "maybe": 31,
    "meet": 32,
    "nice": 33,
    "something": 34,
    "sure,": 35,
    "take": 36,
    "tell": 37,
    "thank": 38,
    "tiny": 39,
    "welcome!": 40,
    "what's": 41,
    "where": 42,
    "yes,": 43,
    "you're": 44,
    "4.": 45,
    "8-bit.": 46,
    "afraid": 47,
    "afternoon": 48,
    "afternoon!": 49,
    "ai?": 50,
    "an": 51,
    "and": 52,
    "bar...": 53,
    "bay": 54,
    "blue.": 55,
    "book.": 56,
    "bored": 57,
    "bot.": 58,
    "break.": 59,
    "by": 60,
    "can't": 61,
    "chat": 62,
    "chatbot.": 63,
    "cloud.": 64,
    "coin": 65,
    "color?": 66,
    "complex": 67,
    "computer.": 68,
    "day": 69,
    "day!": 70,
    "descend!": 71,
    "dice": 72,
    "do?": 73,
    "don't": 74,
    "doors": 75,
    "emotion.": 76,
    "especially": 77,
    "evening": 78,
    "evening!": 79,
    "fair.": 80,
    "favorite": 81,
    "fine,": 82,
    "flip": 83,
    "for": 84,
    "friendly": 85,
    "from?": 86,
    "goodbye!": 87,
    "gradients": 88,
    "great!": 89,
    "great.": 90,
    "heads.": 91,
    "help.": 92,
    "help?": 93,
    "here": 94,
    "hey": 95,
    "hope": 96,
    "humans.": 97,
    "intelligence": 98,
    "internet.": 99,
    "into": 100,
    "joke": 101,
    "language": 102,
    "like.": 103,
    "little.": 104,
    "live": 105,
    "live?": 106,
    "love?": 107,
    "made": 108,
    "matrices": 109,
    "maybe,": 110,
    "me.": 111,
    "morning": 112,
    "morning!": 113,
    "much": 114,
    "much,": 115,
    "music?": 116,
    "name?": 117,
    "need?": 118,
    "night": 119,
    "no": 120,
    "not": 121,
    "okay.": 122,
    "old": 123,
    "one.": 124,
    "open": 125,
    "optional.": 126,
    "pineapple": 127,
    "pizza?": 128,
    "please": 129,
    "pod": 130,
    "programmer": 131,
    "programming": 132,
    "python?": 133,
    "raining?": 134,
    "reading": 135,
    "robot?": 136,
    "roll": 137,
    "sad": 138,
    "see": 139,
    "sleep": 140,
    "so!": 141,
    "sounds": 142,
    "sunny?": 143,
    "teach": 144,
    "thanks": 145,
    "thanks.": 146,
    "that's": 147,
    "that.": 148,
    "there!": 149,
    "time?": 150,
    "timeless.": 151,
    "tired": 152,
    "too.": 153,
    "trust": 154,
    "try": 155,
    "umbrella.": 156,
    "up?": 157,
    "vectors.": 158,
    "very": 159,
    "walks": 160,
    "watch.": 161,
    "weather?": 162,
    "well.": 163,
    "who": 164,
    "world.": 165,
    "yes": 166,
    "you!": 167,
    "you.": 168
  },
  "id2token": [
    "<pad>",
    "<sos>",
    "<eos>",
    "<unk>",
    "a",
    "you",
    "i",
    "good",
    "is",
    "what",
    "i'm",
    "are",
    "do",
    "the",
    "like",
    "me",
    "you?",
    "bye",
    "can",
    "how",
    "to",
    "your",
    "am",
    "happy",
    "have",
    "hello",
    "hello!",
    "help",
    "hi",
    "in",
    "it",
    "maybe",
    "meet",
    "nice",
    "something",
    "sure,",
    "take",
    "tell",
    "thank",
    "tiny",
    "welcome!",
    "what's",
    "where",
    "yes,",
    "you're",
    "4.",
    "8-bit.",
    "afraid",
    "afternoon",
    "afternoon!",
    "ai?",
    "an",
    "and",
    "bar...",
    "bay",
    "blue.",
    "book.",
    "bored",
    "bot.",
    "break.",
    "by",
    "can't",
    "chat",
    "chatbot.",
    "cloud.",
    "coin",
    "color?",
    "complex",
    "computer.",
    "day",
    "day!",
    "descend!",
    "dice",
    "do?",
    "don't",
    "doors",
    "emotion.",
    "especially",
    "evening",
    "evening!",
    "fair.",
    "favorite",
    "fine,",
    "flip",
    "for",
    "friendly",
    "from?",
    "goodbye!",
    "gradients",
    "great!",
    "great.",
    "heads.",
    "help.",
    "help?",
    "here",
    "hey",
    "hope",
    "humans.",
    "intelligence",
    "internet.",
    "into",
    "joke",
    "language",
    "like.",
    "little.",
    "live",
    "live?",
    "love?",
    "made",
    "matrices",
    "maybe,",
    "me.",
    "morning",
    "morning!",
    "much",
    "much,",
    "music?",
    "name?",
    "need?",
    "night",
    "no",
    "not",
    "okay.",
    "old",
    "one.",
    "open",
    "optional.",
    "pineapple",
    "pizza?",
    "please",
    "pod",
    "programmer",
    "programming",
    "python?",
    "raining?",
    "reading",
    "robot?",
    "roll",
    "sad",
    "see",
    "sleep",
    "so!",
    "sounds",
    "sunny?",
    "teach",
    "thanks",
    "thanks.",
    "that's",
    "that.",
    "there!",
    "time?",
    "timeless.",
    "tired",
    "too.",
    "trust",
    "try",
    "umbrella.",
    "up?",
    "vectors.",
    "very",
    "walks",
    "watch.",
    "weather?",
    "well.",
    "who",
    "world.",
    "yes",
    "you!",
    "you."
  ],
  "min_freq": 1
}